In [2]:
import pandas as pd

#Read and preview data
schools = pd.read_csv("schools.csv")
schools.head(3)

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1

#Finding schools with the best math scores

In [6]:
best_score = 800 * 0.8
#Filtering schools
best_math_schools = schools[schools["average_math"] >= best_score]

#Sort from largest to smallest DataFrame for "average_math"
best_math_schools = best_math_schools.sort_values("average_math", ascending=False)
best_math_schools[["school_name","average_math"]]

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641